tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

cask_args appdir: "~/Applications"

# Security
# Rosetta is needed for LastPas on Silicon chips
cask "lastpass"
brew "lastpass-cli"

# Source control
brew "git"

# Programming Languages
brew "go"
brew "python"
brew "pyenv"

# Docker & Containers
brew "docker" 
brew "docker-compose"
# whalebrew "whalebrew/wget"

# Infra
brew "terraform"

#  Browsers
cask "google-chrome"
cask "opera"

# Productivity/Comms
cask "slack"
cask "zoom"
cask "google-drive"
cask "grammarly"

# Text Editors & IDEs
cask "sublime-text"
cask "visual-studio-code"

# Terminal(s)
cask "iterm2"
brew "zsh"
brew "zsh-syntax-highlighting"

# For Oh-my-zsh sh -c "$(curl -fsSL https://raw.githubusercontent.com/robbyrussell/oh-my-zsh/master/tools/install.sh)"

# CLIs
cask "google-cloud-sdk"

# Data
# cask "tableplus"
# cask "anaconda"

# Images
cask "gimp"

# General
# ToDo: Add setup for mackup
brew "mackup"

# Apple Store apps
# Not working at the moment - I suspect it is to do with payment options for the apple id
#mas "Lightshot Screenshot", id: 526298438

